---
type: DistributionSysTypeSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# DistributionSysTypeSet

`Autodesk.Revit.DB.Electrical.DistributionSysTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DistributionSysTypeSet | — | `public DistributionSysTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( DistributionSysType item )` |
| Method | Erase | — | `public virtual int Erase ( DistributionSysType item )` |
| Method | ForwardIterator | — | `public virtual DistributionSysTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( DistributionSysType item )` |
| Method | ReverseIterator | — | `public virtual DistributionSysTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |